<a href="https://colab.research.google.com/github/difo23/BitacorasDataScienceDominicano/blob/master/curso_platzi_class_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Series e Indexación y selección de datos

In [ ]:
import numpy as np # Import numpy and pandas library for the projects

In [ ]:
import pandas as pd

In [ ]:
# This a simply array of number 
np.array([2,3,4,5,1])

array([2, 3, 4, 5, 1])

In [ ]:
# Create series with pandas, this have index columns 
sr = pd.Series([2,3,4,5,1])
sr

0    2
1    3
2    4
3    5
4    1
dtype: int64

In [ ]:
# Show values
sr.values

array([2, 3, 4, 5, 1])

In [ ]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
sr.shape

(5,)

In [ ]:
sr.all

<bound method Series.all of 0    2
1    3
2    4
3    5
4    1
dtype: int64>

In [ ]:
# Can chage the index of series pandas
sr = pd.Series([8,7,2,3,4,5], index= ['a','b','c','d','f','g'])

a    8
b    7
c    2
d    3
f    4
g    5
dtype: int64

In [ ]:
# The dictionaries can become pandas series.
dic_data = {'MX':100,'AR':200,'PR':300}
dic_data

{'AR': 200, 'MX': 100, 'PR': 300}

In [23]:
pd.__version__

'1.1.5'

In [26]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [53]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [55]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])

In [56]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [45]:
# Show the columns
df[['cm','pais']]

           cm pais
ana       115   co
benito    110   mx
camilo    130   co
daniel    155   mx
erika     125   mx
fabian    120   ch
gabriela  125   ch

In [49]:
df.loc['ana',['cm','edad']]

cm      115
edad     10
Name: ana, dtype: object

In [52]:
df.loc[['ana', 'erika'],['cm','edad']] # Return ana and erika age and cm

        cm  edad
ana    115    10
erika  125    12

In [57]:
df.loc['ana','cm'] # Return 115 value in the cell match with row ana and column cm

115

In [62]:
df.iloc[0,1] # Is the same! More fast only need the number of [row, column] (this start in 0, 0)

115

In [65]:
df.iloc[0,[1,3]]

cm        115
genero      M
Name: ana, dtype: object

In [66]:
df.iloc[:,[1,3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

In [70]:
df.iloc[0,range(3)]

edad     10
cm      115
pais     co
Name: ana, dtype: object

## Function Query in DataFrames with pandas

In [60]:
df.query('cm > 130 ')

        edad   cm pais genero  Q1  Q2
daniel    14  155   mx      M NaN   8

In [72]:
df[(df['edad'] >= 12) & (df['pais'] == 'mx')] # operator & is and

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

Hello Google Drive!

In [77]:
df.query('(edad >= 12) and (pais == "mx")') # operator and, this is the same of before

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

## Conect with drive and load csv

In [78]:
from google.colab import drive
drive.mount('/gdrive')

Mounted at /gdrive

In [80]:
%cd '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db'

/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db

In [85]:
!ls

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	Meteorite_Landings.csv
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	poblacion.csv
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test.hdf
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test.json
covid_19_data.csv				test.parquet
flights.db					test.pkl
GlobalLandTemperaturesByCountry.csv		test.xlsx
london_merged.csv

In [94]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.csv')

In [95]:
dir_pandas

'/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/test_lizandro.csv'

### Save DataFrame in csv

In [96]:
df.to_csv(dir_pandas)

In [97]:
!ls

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	Meteorite_Landings.csv
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	poblacion.csv
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test.hdf
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test.json
covid_19_data.csv				test_lizandro.csv
flights.db					test.parquet
GlobalLandTemperaturesByCountry.csv		test.pkl
london_merged.csv				test.xlsx

In [98]:
!cat test_lizandro.csv

,edad,cm,pais,genero,Q1,Q2
ana,10,115,co,M,5.0,7
benito,9,110,mx,F,10.0,9
camilo,13,130,co,F,8.0,9
daniel,14,155,mx,M,,8
erika,12,125,mx,M,7.0,8
fabian,11,120,ch,M,8.0,8
gabriela,12,125,ch,F,3.0,9

In [108]:
df.to_csv(dir_pandas, index= True) # Yo can add index with True, False otherwise

In [109]:
!cat test_lizandro.csv

,edad,cm,pais,genero,Q1,Q2
ana,10,115,co,M,5.0,7
benito,9,110,mx,F,10.0,9
camilo,13,130,co,F,8.0,9
daniel,14,155,mx,M,,8
erika,12,125,mx,M,7.0,8
fabian,11,120,ch,M,8.0,8
gabriela,12,125,ch,F,3.0,9

In [110]:
df_read_drive = pd.read_csv(dir_pandas)
df_read_drive

  Unnamed: 0  edad   cm pais genero    Q1  Q2
0        ana    10  115   co      M   5.0   7
1     benito     9  110   mx      F  10.0   9
2     camilo    13  130   co      F   8.0   9
3     daniel    14  155   mx      M   NaN   8
4      erika    12  125   mx      M   7.0   8
5     fabian    11  120   ch      M   8.0   8
6   gabriela    12  125   ch      F   3.0   9

In [115]:
df.to_csv(dir_pandas, sep= '|', index= False) # You can change the separator with sep

In [117]:
!cat test_lizandro.csv

edad|cm|pais|genero|Q1|Q2
10|115|co|M|5.0|7
9|110|mx|F|10.0|9
13|130|co|F|8.0|9
14|155|mx|M||8
12|125|mx|M|7.0|8
11|120|ch|M|8.0|8
12|125|ch|F|3.0|9

In [116]:
df_read_drive = pd.read_csv(dir_pandas, sep='|')
df_read_drive

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

### Use progresSQL in the notebook

In [1]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /usr/local/lib/python3.7/dist-packages (2.8.6)

In [2]:
import pandas as pd
import psycopg2

In [13]:
!apt install postgresql postgresql-contrib &>log

In [14]:
!service postgresql start

 * Starting PostgreSQL 10 database server
   ...done.

In [21]:
!sudo -u postgres psql -c "CREATE USER root WITH SUPERUSER"

CREATE ROLE

In [22]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [23]:
%config SqlMagic.feedback=False

In [24]:
%config SqlMagic.autopandas=True

In [25]:
%sql postgresql+psycopg2://@/postgres

'Connected: @postgres'

In [32]:
query_sql = '''
select *
from pg_catalog.pg_tables
limit 10
'''

In [33]:
df = %sql $query_sql

 * postgresql+psycopg2://@/postgres

In [34]:
df.head(10)

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

# Work with excel

In [44]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.xlsx')

In [50]:
df.to_excel(dir_pandas, index=False, sheet_name='platzi') # Save is with DataFrame

In [51]:
pd.read_excel(dir_pandas) # Read is with pandas

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Format JSON

In [52]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.json')

In [55]:
df.to_json(dir_pandas, indent=False) # Save is with DataFrame

In [56]:
pd.read_json(dir_pandas) # Read is with pandas

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Format pickle binary

In [57]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.pkl')

In [62]:
df.to_pickle(dir_pandas) # Save is with DataFrame

In [64]:
pd.read_pickle(dir_pandas) # Save is with DataFrame

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Format parquet and hdf form apache, big data and Hadoop

In [65]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.parquet')

In [66]:
df.to_parquet(dir_pandas) # Save is with DataFrame

In [67]:
pd.read_parquet(dir_pandas)

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

In [76]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.h5')

Note: HDF is now .h5

In [77]:
df.to_hdf(dir_pandas, key='data', format='table') # Save is with DataFrame

In [78]:
pd.read_hdf(dir_pandas)

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Work with [Google dataset search ](https://datasetsearch.research.google.com/)

In [4]:
%cd '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db'

/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db

In [5]:
!ls # Need to move

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	test.hdf
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	test.json
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test_lizandro.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test_lizandro.h5
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test_lizandro.hdf
covid_19_data.csv				test_lizandro.json
flights.db					test_lizandro.parquet
GlobalLandTemperaturesByCountry.csv		test_lizandro.pkl
london_merged.csv				test_lizandro.xlsx
Meteorite_Landings.csv				test.parquet
poblacion.csv					test.pkl
test.csv					test.xlsx

In [6]:
import pandas as pd

In [33]:
df_meteorite = pd.read_csv('./Meteorite_Landings.csv')

In [34]:
df_meteorite.sample(10) # take a sample random from the table

                          name     id  ... reclong             GeoLocation
12407  Frontier Mountain 95006  10691  ...   160.4  (-72.96528, 160.43111)
879        San Pedro de Quiles  23130  ...   -71.4      (-31.01667, -71.4)
30509    Northwest Africa 7488  56311  ...     0.0              (0.0, 0.0)
1383                 Acfer 268    276  ...     3.9     (27.51389, 3.87528)
19122    Larkman Nunatak 06278  49554  ...     0.0              (0.0, 0.0)
774                   Pavlovka  18177  ...    43.0        (52.03333, 43.0)
42063            Yamato 793406  28755  ...    35.7       (-71.5, 35.66667)
29678    Northwest Africa 6095  51504  ...     0.0              (0.0, 0.0)
2767        Allan Hills A78026   1642  ...   159.7  (-76.71667, 159.66667)
8803        Finger Ridge 01601  10098  ...     nan                     NaN

[10 rows x 10 columns]

In [35]:
df_meteorite.shape # (rows, columns)

(45716, 10)

In [36]:
df_meteorite.size # rows * columns

457160

In [37]:
df_meteorite.describe() # Data statistics from my number type columns

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

In [38]:
pd.options.display.float_format = '{:,.1f}'.format # change the notation format in the discribe function

In [39]:
df_meteorite.describe(include='all') # Data statistics from my number and text type columns

                       name       id nametype  ...   reclat  reclong GeoLocation
count                 45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique                45716      nan        2  ...      nan      nan       17100
top     Miller Range 090422      nan    Valid  ...      nan      nan  (0.0, 0.0)
freq                      1      nan    45641  ...      nan      nan        6214
mean                    NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std                     NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min                     NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%                     NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%                     NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%                     NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max                     NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

In [40]:
df_meteorite.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [41]:
df_meteorite.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [42]:
df_meteorite[['fall', 'nametype']]= df_meteorite[['fall', 'nametype']].astype('category')

In [43]:
df_meteorite.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [44]:
df_meteorite['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [45]:
df_meteorite['fall'].value_counts() # Frequency

Found    44609
Fell      1107
Name: fall, dtype: int64

In [46]:
pd.get_dummies(df_meteorite['fall']) # create vars dummy very good for analytics, fall 1 or 0 and found 1 or 0

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [47]:
df_meteorite[['fell', 'found']] = pd.get_dummies(df_meteorite['fall'])

In [51]:
df_meteorite.tail(10)

             name     id nametype  ...             GeoLocation  fell found
45706     Zerkaly  31354    Valid  ...    (52.13333, 81.96667)     0     1
45707    Zhaoping  54609    Valid  ...   (24.23333, 111.18333)     0     1
45708    Zhigansk  30405    Valid  ...           (68.0, 128.3)     0     1
45709  Zhongxiang  30406    Valid  ...           (31.2, 112.5)     0     1
45710  Zillah 001  31355    Valid  ...       (29.037, 17.0185)     0     1
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[10 rows x 12 columns]

In [55]:
# Create NaN if the number is not a type date
date_format= pd.to_datetime(
    df_meteorite['year'],
    errors = 'coerce', 
    format ='%m/%d/%Y %H:%M:%S %p'
)

date_format

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

In [56]:
df_meteorite['year'] = date_format

In [57]:
df_meteorite.tail(10)

             name     id nametype  ...             GeoLocation  fell found
45706     Zerkaly  31354    Valid  ...    (52.13333, 81.96667)     0     1
45707    Zhaoping  54609    Valid  ...   (24.23333, 111.18333)     0     1
45708    Zhigansk  30405    Valid  ...           (68.0, 128.3)     0     1
45709  Zhongxiang  30406    Valid  ...           (31.2, 112.5)     0     1
45710  Zillah 001  31355    Valid  ...       (29.037, 17.0185)     0     1
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[10 rows x 12 columns]

In [66]:
df_meteorite.dtypes # Will have a new type of data datetime64

name                   object
id                      int64
nametype             category
recclass               object
mass_g                float64
fall                 category
year           datetime64[ns]
reclong               float64
GeoLocation            object
fell                    uint8
found                   uint8
dtype: object

In [59]:
df_meteorite.rename(columns={'mass (g)':'mass_g'}, inplace=True) # change the name mass (g) by mass_g and save this with inplace in true

## All about delete columns, rows and register, extra correctly copy dataframare

In [65]:
df_meteorite.drop(['reclat'], axis=1, inplace=True) # delete columns two optios in axis o for index or rows and 1 for columns

In [67]:
df_meteorite.head(10)

                  name   id nametype  ...           GeoLocation  fell found
0               Aachen    1    Valid  ...     (50.775, 6.08333)     1     0
1               Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
2                 Abee    6    Valid  ...    (54.21667, -113.0)     1     0
3             Acapulco   10    Valid  ...     (16.88333, -99.9)     1     0
4              Achiras  370    Valid  ...   (-33.16667, -64.95)     1     0
5             Adhi Kot  379    Valid  ...          (32.1, 71.8)     1     0
6  Adzhi-Bogdo (stone)  390    Valid  ...  (44.83333, 95.16667)     1     0
7                 Agen  392    Valid  ...   (44.21667, 0.61667)     1     0
8               Aguada  398    Valid  ...    (-31.6, -65.23333)     1     0
9        Aguila Blanca  417    Valid  ...   (-30.86667, -64.55)     1     0

[10 rows x 11 columns]

In [68]:
df_meteorite.drop([0,2,3,6], axis=0, inplace=True) # delete rows two optios in axis o for index or rows and 1 for columns

In [69]:
df_meteorite.head(10)

                name   id nametype  ...           GeoLocation  fell found
1             Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
4            Achiras  370    Valid  ...   (-33.16667, -64.95)     1     0
5           Adhi Kot  379    Valid  ...          (32.1, 71.8)     1     0
7               Agen  392    Valid  ...   (44.21667, 0.61667)     1     0
8             Aguada  398    Valid  ...    (-31.6, -65.23333)     1     0
9      Aguila Blanca  417    Valid  ...   (-30.86667, -64.55)     1     0
10  Aioun el Atrouss  423    Valid  ...  (16.39806, -9.57028)     1     0
11               Aïr  424    Valid  ...   (19.08333, 8.38333)     1     0
12   Aire-sur-la-Lys  425    Valid  ...   (50.66667, 2.33333)     1     0
13             Akaba  426    Valid  ...     (29.51667, 35.05)     1     0

[10 rows x 11 columns]

In [71]:
df_meteorite.drop(index=[1,4,10,11], columns=['name', 'recclass'], inplace=True)

In [72]:
df_meteorite.head(10)

     id nametype   mass_g  fall  ... reclong           GeoLocation fell  found
5   379    Valid  4,239.0  Fell  ...    71.8          (32.1, 71.8)    1      0
7   392    Valid 30,000.0  Fell  ...     0.6   (44.21667, 0.61667)    1      0
8   398    Valid  1,620.0  Fell  ...   -65.2    (-31.6, -65.23333)    1      0
9   417    Valid  1,440.0  Fell  ...   -64.5   (-30.86667, -64.55)    1      0
12  425    Valid      nan  Fell  ...     2.3   (50.66667, 2.33333)    1      0
13  426    Valid    779.0  Fell  ...    35.0     (29.51667, 35.05)    1      0
14  427    Valid  1,800.0  Fell  ...    78.0     (29.71667, 77.95)    1      0
15  432    Valid  3,000.0  Fell  ...     8.4    (8.91667, 8.43333)    1      0
16  433    Valid 50,000.0  Fell  ...    42.8  (39.91667, 42.81667)    1      0
17  446    Valid    160.0  Fell  ...    39.5  (24.41667, 39.51667)    1      0

[10 rows x 9 columns]

In [ ]:
df_new = df_meteorite.copy(deep=True) # Deep is important for value copy and deep in false is copy by reference

In [ ]:
# It is recommended to always copy your origin data frame and work with this copy.